tylertms/dspic33e-sim/conformance/uart.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} UartConformance;

static const uint16_t bases[DSPIC33_UART_COUNT] = {0x0220u, 0x0230u, 0x0250u, 0x02b0u};
static const uint8_t receive_irqs[DSPIC33_UART_COUNT] = {11u, 30u, 82u, 88u};
static const uint8_t transmit_irqs[DSPIC33_UART_COUNT] = {12u, 31u, 83u, 89u};
static const uint8_t error_irqs[DSPIC33_UART_COUNT] = {65u, 66u, 81u, 87u};
static const uint16_t pmd_addresses[DSPIC33_UART_COUNT] = {0x0760u, 0x0760u, 0x0764u,
                                                           0x0766u};
static const uint16_t pmd_masks[DSPIC33_UART_COUNT] = {0x0020u, 0x0040u, 0x0008u,
                                                       0x0020u};

static void expect(UartConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[uart-failed] %s\n", name);
    }
}

static bool interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    dspic33_write_word(cpu, address, (uint16_t)~(uint16_t)(1u << (irq % 16u)));
}

static uint64_t frame_cycles(uint16_t mode, uint16_t baud,
                             const Dspic33UartFrame* frame) {
    uint64_t clocks = (mode & 0x0008u) != 0u ? 4u : 16u;
    uint64_t bits =
        frame->break_signal
            ? 14u
            : (uint64_t)(1u + frame->data_bits + frame->stop_bits +
                         (frame->parity == DSPIC33_UART_PARITY_NONE ? 0u : 1u));
    return ((uint64_t)baud + 1u) * clocks * bits;
}

static Dspic33UartParity mode_parity(uint16_t mode) {
    if ((mode & 6u) == 2u) {
        return DSPIC33_UART_PARITY_EVEN;
    }
    if ((mode & 6u) == 4u) {
        return DSPIC33_UART_PARITY_ODD;
    }
    return DSPIC33_UART_PARITY_NONE;
}

static uint8_t mode_data_bits(uint16_t mode) { return (mode & 6u) == 6u ? 9u : 8u; }

static void configure(Dspic33* cpu, uint8_t channel, uint16_t mode, uint16_t status,
                      uint16_t baud) {
    uint16_t base = bases[channel];
    dspic33_write_word(cpu, base, mode);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), baud);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), status);
}

static bool receive_frame(Dspic33* cpu, uint8_t channel, const Dspic33UartFrame* frame,
                          uint64_t delay) {
    return dspic33_uart_receive_frame(cpu, channel, frame, delay) &&
           dspic33_device_advance(cpu, delay);
}

static void configure_dma(Dspic33* cpu, uint8_t channel, uint16_t control,
                          uint8_t request, uint32_t memory, uint16_t pad,
                          uint16_t count) {
    uint16_t base = (uint16_t)(0x0b00u + channel * 0x10u);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), (uint16_t)memory);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(memory >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)memory);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0au), (uint16_t)(memory >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), count);
    dspic33_write_word(cpu, base, (uint16_t)(0x8000u | control));
}

static uint16_t memory_word(Dspic33* cpu, uint32_t address) {
    return (uint16_t)(cpu->data[address] | ((uint16_t)cpu->data[address + 1u] << 8u));
}

static void write_memory_word(Dspic33* cpu, uint32_t address, uint16_t value) {
    cpu->data[address] = (uint8_t)value;
    cpu->data[address + 1u] = (uint8_t)(value >> 8u);
}

static void register_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        uint16_t base = bases[channel];
        dspic33_reset(cpu, 0u);
        expect(state, dspic33_read_word(cpu, base) == 0u, "mode reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0x0110u,
               "status reset");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0xe1f0u,
               "disabled transmitter controls");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "baud reset");
        dspic33_write_word(cpu, base, 0xffffu);
        expect(state, dspic33_read_word(cpu, base) == 0xbbffu, "mode write mask");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0xedf0u,
               "status write mask");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0xa55au);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0u,
               "receive register read only");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xa55au);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0xa55au,
               "baud full width");
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        dspic33_write_word(cpu, base, 0x8000u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1234u);
        expect(state, dspic33_read_word(cpu, base) == 0xbbffu,
               "PMD preserves mode and blocks write");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0xa55au,
               "PMD blocks baud write");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0xe1f0u,
               "PMD preserves controls and resets runtime");
    }
}

