tylertms/dspic33e-sim/conformance/uart.c
static void receive_error_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t combination;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        for (combination = 0u; combination < 4u; combination++) {
            Dspic33UartFrame frame;
            uint16_t expected = (uint16_t)(((combination & 1u) != 0u ? 0x0008u : 0u) |
                                           ((combination & 2u) != 0u ? 0x0004u : 0u));
            dspic33_reset(cpu, 0u);
            configure(cpu, channel, 0x8002u, 0u, 0u);
            clear_interrupt(cpu, error_irqs[channel]);
            memset(&frame, 0, sizeof(frame));
            frame.value = 0x5au;
            frame.parity_error = (combination & 1u) != 0u;
            frame.framing_error = (combination & 2u) != 0u;
            expect(state, receive_frame(cpu, channel, &frame, 0u),
                   "receive error schedule");
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x000cu) == expected,
                   "receive buffered error status");
            expect(state, interrupt_flag(cpu, error_irqs[channel]) == (expected != 0u),
                   "receive error interrupt");
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(bases[channel] + 6u)) == 0x5au,
                   "receive error data");
        }
    }
    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8006u, 0u, 0u);
    {
        Dspic33UartFrame frame;
        memset(&frame, 0, sizeof(frame));
        frame.value = 0x1a5u;
        frame.parity_error = true;
        expect(state, receive_frame(cpu, 0u, &frame, 0u), "nine bit parity schedule");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(bases[0] + 2u)) & 0x0008u) == 0u,
               "nine bit ignores parity error");
    }
}

static void special_receive_cases(UartConformance* state, Dspic33* cpu) {
    Dspic33UartFrame frame;
    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8006u, 0x0020u, 0u);
    memset(&frame, 0, sizeof(frame));
    frame.value = 0x055u;
    expect(state, receive_frame(cpu, 0u, &frame, 0u), "address data schedule");
    expect(state, (dspic33_read_word(cpu, (uint16_t)(bases[0] + 2u)) & 1u) == 0u,
           "address detect discards data word");
    frame.value = 0x155u;
    expect(state, receive_frame(cpu, 0u, &frame, 0u), "address word schedule");
    expect(state, dspic33_read_word(cpu, (uint16_t)(bases[0] + 6u)) == 0x155u,
           "address detect accepts address word");

    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8080u, 0u, 0u);
    clear_interrupt(cpu, receive_irqs[0]);
    memset(&frame, 0, sizeof(frame));
    frame.value = 0x33u;
    expect(state, receive_frame(cpu, 0u, &frame, 0u), "wake byte schedule");
    expect(state,
           (dspic33_read_word(cpu, bases[0]) & 0x0080u) == 0u &&
               (dspic33_read_word(cpu, (uint16_t)(bases[0] + 2u)) & 1u) == 0u &&
               interrupt_flag(cpu, receive_irqs[0]),
           "wake byte ignored and interrupt raised");

    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8020u, 0u, 0x1234u);
    clear_interrupt(cpu, receive_irqs[0]);
    memset(&frame, 0, sizeof(frame));
    frame.value = 0x55u;
    frame.baud_period = 0x0456u;
    expect(state, receive_frame(cpu, 0u, &frame, 0u), "auto baud schedule");
    expect(state,
           (dspic33_read_word(cpu, bases[0]) & 0x0020u) == 0u &&
               dspic33_read_word(cpu, (uint16_t)(bases[0] + 8u)) == 0x0456u &&
               (dspic33_read_word(cpu, (uint16_t)(bases[0] + 2u)) & 1u) == 0u &&
               interrupt_flag(cpu, receive_irqs[0]),
           "auto baud captures period and ignores byte");
}

static void transmit_fifo_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t index;
    Dspic33UartFrame output;
    Dspic33UartFrame timing;
    uint64_t cycles;
    memset(&timing, 0, sizeof(timing));
    timing.data_bits = 8u;
    timing.stop_bits = 1u;
    timing.parity = DSPIC33_UART_PARITY_NONE;
    cycles = frame_cycles(0x8000u, 0u, &timing);
    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8000u, 0x0400u, 0u);
    for (index = 0u; index < 6u; index++) {
        dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), (uint16_t)(0x20u + index));
    }
    expect(state, (dspic33_read_word(cpu, (uint16_t)(bases[0] + 2u)) & 0x0200u) != 0u,
           "transmit FIFO full");
    for (index = 0u; index < 5u; index++) {
        expect(state, dspic33_device_advance(cpu, cycles), "transmit FIFO advance");
        expect(state,
               dspic33_uart_transmit(cpu, 0u, &output) &&
                   output.value == (uint16_t)(0x20u + index),
               "transmit FIFO ordering");
    }
    expect(state, !dspic33_uart_transmit(cpu, 0u, &output),
           "transmit FIFO ignores overflow write");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(bases[0] + 2u)) & 0x0300u) == 0x0100u,
           "transmit FIFO empty status");
}

static void transmit_timing_cases(UartConformance* state, Dspic33* cpu) {
    static const uint16_t modes[] = {0x8000u, 0x8001u, 0x8002u, 0x8004u,
                                     0x8006u, 0x8008u, 0x9008u};
    static const uint16_t bauds[] = {0u, 1u, 0x00ffu, 0xffffu};
    uint8_t mode_index;
    uint8_t baud_index;
    for (mode_index = 0u; mode_index < sizeof(modes) / sizeof(modes[0]); mode_index++) {
        for (baud_index = 0u; baud_index < sizeof(bauds) / sizeof(bauds[0]);
             baud_index++) {
            Dspic33UartFrame expected;
            Dspic33UartFrame output;
            uint64_t cycles;
            uint16_t mode = modes[mode_index];
            uint16_t baud = bauds[baud_index];
            memset(&expected, 0, sizeof(expected));
            expected.data_bits = mode_data_bits(mode);
            expected.stop_bits = (mode & 1u) != 0u ? 2u : 1u;
            expected.parity = mode_parity(mode);
            cycles = frame_cycles(mode, baud, &expected);
            dspic33_reset(cpu, 0u);
            configure(cpu, 0u, mode, 0x0400u, baud);
            dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0xa5u);
            expect(state,
                   dspic33_device_advance(cpu, cycles - 1u) &&
                       !dspic33_uart_transmit(cpu, 0u, &output),
                   "transmit timing lower boundary");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       dspic33_uart_transmit(cpu, 0u, &output),
                   "transmit timing completion boundary");
            expect(state,
                   output.baud_period == baud &&
                       output.data_bits == expected.data_bits &&
                       output.stop_bits == expected.stop_bits &&
                       output.parity == expected.parity &&
                       output.irda == ((mode & 0x1000u) != 0u),
                   "transmit timing frame metadata");
        }
    }
}

