tylertms/dspic33e-sim/conformance/uart.c
static void transmit_mode_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t interrupt_mode;
    Dspic33UartFrame output;
    for (interrupt_mode = 0u; interrupt_mode < 3u; interrupt_mode++) {
        uint16_t status =
            (uint16_t)(0x0400u | ((interrupt_mode & 1u) != 0u ? 0x2000u : 0u) |
                       ((interrupt_mode & 2u) != 0u ? 0x8000u : 0u));
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, bases[0], 0x8000u);
        clear_interrupt(cpu, transmit_irqs[0]);
        dspic33_write_word(cpu, (uint16_t)(bases[0] + 2u), status);
        expect(state, interrupt_flag(cpu, transmit_irqs[0]),
               "transmit enable interrupt mode");
        clear_interrupt(cpu, transmit_irqs[0]);
        dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x3cu);
        expect(state,
               interrupt_flag(cpu, transmit_irqs[0]) ==
                   (interrupt_mode == 0u || interrupt_mode == 2u),
               "transmit start interrupt mode");
        clear_interrupt(cpu, transmit_irqs[0]);
        expect(state, dspic33_device_advance(cpu, 160u),
               "transmit interrupt completion advance");
        expect(state, interrupt_flag(cpu, transmit_irqs[0]) == (interrupt_mode == 1u),
               "transmit completion interrupt mode");
        expect(state, dspic33_uart_transmit(cpu, 0u, &output),
               "transmit interrupt output");
    }

    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x9041u, 0x4400u, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x5au);
    expect(state, dspic33_device_advance(cpu, 176u), "loopback advance");
    expect(state,
           dspic33_uart_transmit(cpu, 0u, &output) && output.value == 0x5au &&
               output.stop_bits == 2u && output.inverted && output.irda,
           "loopback transmit metadata");
    expect(state, dspic33_read_word(cpu, (uint16_t)(bases[0] + 6u)) == 0x5au,
           "loopback receive data");

    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, bases[channel], 0x8000u);
        clear_interrupt(cpu, transmit_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0x0400u);
        expect(state, interrupt_flag(cpu, transmit_irqs[channel]),
               "transmit enable raises interrupt");
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u), 0x5au);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0u);
        expect(state,
               dspic33_device_advance(cpu, 1000u) &&
                   !dspic33_uart_transmit(cpu, channel, &output) &&
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0511u) == 0x0110u,
               "transmit disable aborts and resets transmitter");

        dspic33_reset(cpu, 0u);
        configure(cpu, channel, 0x8000u, 0x0c00u, 0u);
        clear_interrupt(cpu, transmit_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u), 0x7eu);
        expect(state, !interrupt_flag(cpu, transmit_irqs[channel]),
               "break transfer suppresses transmit interrupt");
        expect(state, dspic33_device_advance(cpu, 224u), "break advance");
        expect(state,
               dspic33_uart_transmit(cpu, channel, &output) && output.break_signal &&
                   output.value == 0u && output.data_bits == 12u &&
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0800u) == 0u,
               "break frame and automatic clear");
    }
}

static void cts_cases(UartConformance* state, Dspic33* cpu) {
    Dspic33UartFrame output;
    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8200u, 0x0400u, 0u);
    expect(state,
           dspic33_uart_set_cts(cpu, 0u, false, 0u) && dspic33_device_advance(cpu, 0u),
           "CTS block schedule");
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x99u);
    expect(state,
           dspic33_device_advance(cpu, 1000u) &&
               !dspic33_uart_transmit(cpu, 0u, &output),
           "CTS blocks completion");
    expect(state,
           dspic33_uart_set_cts(cpu, 0u, true, 3u) && dspic33_device_advance(cpu, 2u) &&
               !dspic33_uart_transmit(cpu, 0u, &output),
           "CTS delayed release boundary");
    expect(state, dspic33_device_advance(cpu, 1u), "CTS release event");
    expect(state,
           dspic33_device_advance(cpu, 159u) &&
               !dspic33_uart_transmit(cpu, 0u, &output),
           "CTS transmit timing boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_uart_transmit(cpu, 0u, &output) &&
               output.value == 0x99u,
           "CTS release completes transmit");
}

static void dma_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        uint32_t receive_memory = (uint32_t)(0x3000u + channel * 0x20u);
        uint32_t transmit_memory = receive_memory + 2u;
        Dspic33UartFrame frame;
        Dspic33UartFrame output;
        dspic33_reset(cpu, 0u);
        configure_dma(cpu, channel, 0x0001u, receive_irqs[channel], receive_memory,
                      (uint16_t)(bases[channel] + 6u), 0u);
        configure(cpu, channel, 0x8002u, 0u, 0u);
        memset(&frame, 0, sizeof(frame));
        frame.value = (uint16_t)(0x80u + channel);
        frame.parity_error = true;
        expect(state, receive_frame(cpu, channel, &frame, 0u),
               "UART receive DMA schedule");
        expect(state, dspic33_device_advance(cpu, 0u), "UART receive DMA advance");
        expect(state, memory_word(cpu, receive_memory) == (uint16_t)(0x0880u + channel),
               "UART receive DMA data and error bits");

        dspic33_reset(cpu, 0u);
        write_memory_word(cpu, transmit_memory, (uint16_t)(0x1a0u + channel));
        configure_dma(cpu, channel, 0x2001u, transmit_irqs[channel], transmit_memory,
                      (uint16_t)(bases[channel] + 4u), 0u);
        dspic33_write_word(cpu, bases[channel], 0x8006u);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0x0400u);
        expect(state, dspic33_device_advance(cpu, 0u), "UART transmit DMA request");
        expect(state, dspic33_device_advance(cpu, 176u), "UART transmit DMA advance");
        expect(state,
               dspic33_uart_transmit(cpu, channel, &output) &&
                   output.value == (uint16_t)(0x1a0u + channel),
               "UART transmit DMA data");
    }
}

